# Итоговая контрольная по вводному блоку
**Требуется:**
Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых *меньше, либо равна 3 символам*. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. 

## Описание решения

### Ввод исходных данных

Сначала, через метод **Console.WriteLine()** выводим на экран сообщение о необходимости ввести длину **L** требуемого массива. Далее через метод **Console.ReadLine()** программа считывает эту самую длину и объявляет массив строк **array** с длиной **L**.

Запускаем цикл **for** для задания значений каждому элементу нашего массива.

После того, как все элементы исходного массива заданы, начинаем обрабатывать полученные данные.

### Поиск строк, длина которых меньше либо равна 3

Для начала, создаем пустую строку **count**, в которую будем записывать индексы всех нужных нам строк.
Запускаем цикл прохождения по всем элементам массива **array**. Если длина элемента меньше либо равна 3, то добавляем индекс элемента к строке **count**.

Для того чтобы алгоритм работал с массивами, *размер которых больше 10 элементов*, после каждого добавления вводим разделитель - **запятую**.

Получаем строку **count** вида **"0,2,7,11"**, где числа - индексы необходимых нам элементов.

После чего методом **string.Split()** создаем массив **indexes**, который будет хранить в себе индексы нужных нам элементов. С этим массивом и будем работать далее.

### Создание нового массива

Объявляем массив **new_array** с такой же длиной как и у массива **indexes**. 

Запускаем цикл прохождения по элементам массива **new_array**, на каждый i элемент записываем значение из массива **array** с индексом **indexes[i]**.

Таким образом получим нужный нам массив с элементами, размер которых *менее либо равен 3*.

Выводим полученный массив через консоль..